blumenkratzz/STM32-Motion-Tracking-Mount/Core/Src/main.c
/*
 * Authors: Aleksandr Safronov, Quoc Trung Tran
 * File: main.c
 * Description:
 *   This file contains the core implementation of the motion tracking camera mount,
 *   including algorithms for infrared/thermal tracking and servo motor control.
 *
 *   Hardware:
 *     - Microcontroller: STM32F446RE (64-pin configuration).
 *     - Peripherals: Infrared/thermal sensors, servo motors (controlled via UART).
 *
 *   Software Dependencies:
 *     - MLX90640 API (C++): Used for processing thermal data from the infrared sensors.
 *     - SCSLib: A library for controlling servo motors via UART.
 *
 * License:
 *   Licensed under CC BY-NC 4.0. See LICENSE file for details.
 *   Copyright © 2024 Aleksandr Safronov, Quoc Trung Trun
 *
 * Date:
 *   Last Modified: 2024-12-05
 *
 * Notes:
 *   - The motion tracking algorithm is optimized for medium-distance, indoor use.
 *   - Ensure all sensors are calibrated before running the tracking system.
 */


#include "main.h"
#include <stdio.h>
#include <string.h>
#include <math.h>

// MLX90640 Sensor Includes
#include "MLX90640_API.h"
#include "MLX90640_I2C_Driver.h"
#include "i2c.h"
#include "usart.h"


// Servo Motors Includes
#include "stm32f4xx.h"
#include "SCServo.h"
#include "uart.h"

#define SENSOR_DEBUG 1

#define  FPS2HZ   0x02
#define  FPS4HZ   0x03
#define  FPS8HZ   0x04
#define  FPS16HZ  0x05
#define  FPS32HZ  0x06

#define  MLX90640_ADDR 0x33 //default address
#define	 RefreshRate FPS16HZ //max speed 16
#define  TA_SHIFT 8 //Default shift for MLX90640 in open air
#define  TARGET_MIN_TEMP 24.0f
#define  TARGET_MAX_TEMP 37.0f

// Define constants for sensor numbers
#define SENSOR_LEFT 1
#define SENSOR_MIDDLE 0
#define SENSOR_RIGHT 2

//calibration for average count thingy
#define SENSOR_ARRAY_SIZE 768
#define ROWS 24
#define COLUMNS 32


#define ROW_CHUNK 4
#define COLUMN_CHUNK 2

// Define the number of frames to combine for temporal analysis (inter-frame)
#define NUM_FRAMES_TO_COMBINE 4
#define MINIMUM_TARGET_BLOB_SIZE 4
#define NUM_SENSORS 3

I2C_HandleTypeDef *hi2c;
UART_HandleTypeDef huart2;
ADC_HandleTypeDef hadc1;

// Servo Motor external declarations
extern void setupMotorControl(void);
extern void checkServoConnection(void);
extern void rotateConstantSpeed(uint8_t);
extern float rotateToTargetColumn(uint8_t, int, int);
extern float rotateToTargetRow(uint8_t, int);
extern void calibrateMotors(void);
extern uint32_t MapDelay(uint16_t);
extern uint16_t ReadPotentiometer(void);

static void MX_USART2_UART_Init(void);
float emissivity=0.95;//0.95 is default
int status;
char MLX90640_Test_Buffer[255];
float mlx90640ToAccum[SENSOR_ARRAY_SIZE] = {0}; // Accumulator for temperatures
paramsMLX90640 mlx90640; //struct found in GitHub libraries
typedef struct
{
    I2C_HandleTypeDef *hi2c;
    uint16_t eeMLX90640[832];
    paramsMLX90640 mlx90640;
    uint16_t frame[834];
    float mlx90640To[768];
    int targetDetected;
    int highestRowGroupStart;
    int highestColGroupStart;
    float avg;
    int highestColumnIndex;
    float centroidWeightedSum;
    int blobSize;
} SensorData;

SensorData sensors[3];

typedef struct {
    int zoneNumber;
    float centroidWeightedSumMin;
    float centroidWeightedSumMax;
    int headThresholdPixelCount;
} ZoneInfo;

// Define zones based on physically measured and calibrated values
ZoneInfo zones[] = {
    {1, 3500, INFINITY, 25},
    {2, 1900, 3500, 25},
    {3, 1000, 1900, 20},
    {4, 780, 1000, 18},
    {5, 600, 780, 16},
    {6, 390, 600, 14},
    {7, 290, 390, 10},
    {8, 40, 290, 4},
};

//Hardware Wiring: (FLIP SENSOR_L and SENSOR_R)

	//SENSOR_L
	//PB3 --- SDA PB10 --- SCL FOR I2C2

	//SENSOR_M
	//PB8 --- SDA PB9 --- SCL FOR I2C1

	//SENSOR_R
	//PA8 --- SDA PC9 --- SCL FOR I2C3

	// Servo Control
	//PA9 (TX) and PA10 (RX) are connected to the UART1 (ST-Link USB bridge)

	// Console SENSOR_DEBUG Output
	//PA2 (TX) and PA3 (RX) are connected/hardwired to the ST-Link/V2-1 for the Virtual COM Port (VCP)


int UART_ReadLine(char *buffer, int maxLength) {
    int index = 0;
    char c;

    while (index < maxLength - 1) {
        // Read one character at a time
        if (HAL_UART_Receive(&huart2, (uint8_t *)&c, 1, HAL_MAX_DELAY) == HAL_OK) {
            // Echo back the received character
            HAL_UART_Transmit(&huart2, (uint8_t *)&c, 1, HAL_MAX_DELAY);

            if (c == '\r' || c == '\n') {
                // End of line detected
                break;
            } else if (c == '\b' && index > 0) {
                // Handle backspace
                index--;
                continue;
            } else {
                buffer[index++] = c;
            }
        }
    }
    buffer[index] = '\0'; // Null-terminate the string
    return index;
}

// Functions to process MLX90640 data
int retriever(I2C_HandleTypeDef *hi2c, uint16_t *eeMLX90640, paramsMLX90640 *mlx90640,
              float *mlx90640To, uint16_t *frame, int *targetDetected,
              int *highestRowGroupStart, int *highestColGroupStart, int numFrames)
{
    float emissivity = 0.95; // Emissivity value
    int status;
    // Frame Accumulator Array for temperatures
    // Reset global accumulation array to 0
    memset(mlx90640ToAccum, 0, sizeof(mlx90640ToAccum));
    float tr = 23.15 - TA_SHIFT; // Initialize tr with a default value

    // Read EEPROM data and extract parameters if not done already
    static int parameters_extracted[3] = {0}; // Separate flags for each sensor
       int sensor_index = (hi2c == &hi2c1) ? SENSOR_LEFT : (hi2c == &hi2c2) ? SENSOR_MIDDLE : SENSOR_RIGHT;
    if (!parameters_extracted[sensor_index])
    {
        status = MLX90640_DumpEE(hi2c, MLX90640_ADDR, eeMLX90640);
        if (status != 0)
        {
            sprintf(MLX90640_Test_Buffer, "MLX90640_DumpEE Error: %d\r\n", status);
            HAL_UART_Transmit(&huart2, (uint8_t *)MLX90640_Test_Buffer, strlen(MLX90640_Test_Buffer), HAL_MAX_DELAY);
            return -1;
        }

        status = MLX90640_ExtractParameters(eeMLX90640, mlx90640);
        if (status != 0)
        {
            sprintf(MLX90640_Test_Buffer, "MLX90640_ExtractParameters Error: %d\r\n", status);
            HAL_UART_Transmit(&huart2, (uint8_t *)MLX90640_Test_Buffer, strlen(MLX90640_Test_Buffer), HAL_MAX_DELAY);
            return -1;
        }
        parameters_extracted[sensor_index] = 1;
    }

