blumenkratzz/STM32-Motion-Tracking-Mount/Core/Src/main.c
    // Accumulate temperature data over multiple frames
    for (int f = 0; f < numFrames; f++)
    {
        // Get frame data
        status = MLX90640_GetFrameData(hi2c, MLX90640_ADDR, frame);
        if (status < 0)
        {
            sprintf(MLX90640_Test_Buffer, "MLX90640_GetFrameData Error: %d\r\n", status);
            HAL_UART_Transmit(&huart2, (uint8_t *)MLX90640_Test_Buffer, strlen(MLX90640_Test_Buffer), HAL_MAX_DELAY);
            return -1;
        }

        // Calculate Vdd and Ta
        float vdd = MLX90640_GetVdd(frame, mlx90640);
        float Ta = MLX90640_GetTa(frame, mlx90640);


        // Calculate tr (reflected temperature)
        tr = Ta - TA_SHIFT;

        sprintf(MLX90640_Test_Buffer, "Vdd: %.3f, Ta: %.3f, Tr: %.3f\r\n", vdd, Ta, tr);
        HAL_UART_Transmit(&huart2, (uint8_t *)MLX90640_Test_Buffer, strlen(MLX90640_Test_Buffer), HAL_MAX_DELAY);

        // Calculate To (object temperatures)
        MLX90640_CalculateTo(frame, mlx90640, emissivity, tr, mlx90640To);

        // Check for NaN values
        int nan_found = 0;
        for (int i = 0; i < SENSOR_ARRAY_SIZE; i++)
        {
            if (isnan(mlx90640To[i]))
            {
                nan_found = 1;
                sprintf(MLX90640_Test_Buffer, "NaN found at index %d\r\n", i);
                HAL_UART_Transmit(&huart2, (uint8_t *)MLX90640_Test_Buffer, strlen(MLX90640_Test_Buffer), HAL_MAX_DELAY);
                break;
            }
        }
        if (!nan_found)
        {
            sprintf(MLX90640_Test_Buffer, "No NaN values in mlx90640To\r\n");
            HAL_UART_Transmit(&huart2, (uint8_t *)MLX90640_Test_Buffer, strlen(MLX90640_Test_Buffer), HAL_MAX_DELAY);
        }
        // Accumulate temperatures
        for (int i = 0; i < SENSOR_ARRAY_SIZE; i++)
        {
            mlx90640ToAccum[i] += mlx90640To[i];
        }
    }

    // Calculate average temperatures
    for (int i = 0; i < SENSOR_ARRAY_SIZE; i++)
    {
        mlx90640To[i] = mlx90640ToAccum[i] / numFrames;
    }

    return 0;
}



float overallAvg(float mlx90640To_2[SENSOR_ARRAY_SIZE])
{
    float sum = 0.0;

    // Calculate overall sum
    for (int i = 0; i < SENSOR_ARRAY_SIZE; i++)
    {
        sum += mlx90640To_2[i];
    }
    // Calculate overall average
    float overallAverage = sum / SENSOR_ARRAY_SIZE;

    // Optionally, print the overall average
#ifdef SENSOR_DEBUG
    sprintf(MLX90640_Test_Buffer, "Overall Average: %.2f\n\r", overallAverage);
    HAL_UART_Transmit(&huart2, (uint8_t*)MLX90640_Test_Buffer, strlen(MLX90640_Test_Buffer), HAL_MAX_DELAY);
#endif

    return overallAverage;
}
int avgBySector(float mlx90640To_2[SENSOR_ARRAY_SIZE], int* highestRowGroupStart, int* highestColGroupStart, int* targetDetected, int headThresholdPixelCount, int zoneInfo)
{
    *highestRowGroupStart = -1;
    *highestColGroupStart = -1;
    *targetDetected = 0; // Initialize targetDetected

    int maxRowStart = ROWS - ROW_CHUNK; // Since we're sliding one row at a time

    for (int r = 0; r <= maxRowStart; r++)
    {
        int pixelCountInGroup = 0;

        // For each row in the group
        for (int i = 0; i < ROW_CHUNK; i++)
        {
            int rowIndex = r + i;
            // For each column
            for (int c = 0; c < COLUMNS; c++)
            {
                int index = rowIndex * COLUMNS + c;
                float temp = mlx90640To_2[index];
                if (temp >= TARGET_MIN_TEMP && temp <= TARGET_MAX_TEMP)
                {
                    pixelCountInGroup++;
                }
            }
        }

        // Check if this group meets the headThresholdPixelCount
        if ((pixelCountInGroup >= headThresholdPixelCount) && (zoneInfo!=-1))
        {
            *targetDetected = 1;
            *highestRowGroupStart = r + 1; // Adjusting for 1-based indexing
            // You can break out of the loop since the target is found
            break;
        }
        else
        {
            *targetDetected = 0;
        }
    }

    // If no group meets the threshold, targetDetected remains 0

    // Column calculation logic remains intact
    float highestColGroupAverage = -1.0;

    // Calculate groups of columns average
    for (int c = 0; c < COLUMNS; c += COLUMN_CHUNK)
    {
        float groupColSum = 0.0;
        int colsToSum = (c + COLUMN_CHUNK <= COLUMNS) ? COLUMN_CHUNK : (COLUMNS - c);
        for (int i = 0; i < colsToSum; i++)
        {
            for (int r = 0; r < ROWS; r++)
            {
                groupColSum += mlx90640To_2[r * COLUMNS + (c + i)];
            }
        }
        float groupColAverage = groupColSum / (colsToSum * ROWS);

        // Optional: Print column group average
#ifdef SENSOR_DEBUG
        sprintf(MLX90640_Test_Buffer, "Column Group starting at Column %d Average: %.2f\n\r", c + 1, groupColAverage);
        HAL_UART_Transmit(&huart2, (uint8_t*)MLX90640_Test_Buffer, strlen(MLX90640_Test_Buffer), HAL_MAX_DELAY);
#endif
        // Check if this column group has the highest average
        if (groupColAverage > highestColGroupAverage)
        {
            highestColGroupAverage = groupColAverage;
            *highestColGroupStart = c + 1;
        }
    }

    // Return the starting column of the highest average column group
    return *highestColGroupStart;
}


float getPixelWeight(float temperature)
{
    float centerTemp = 24.0f; // Center of the Gaussian
    float sigma = 2.0f;       // Standard deviation

    // Calculate Gaussian weight
    float weight = exp(-0.5 * pow((temperature - centerTemp) / sigma, 2));

    return weight;
}

void connectedComponents(int binaryMask[ROWS][COLUMNS], int labels[ROWS][COLUMNS], int *numComponents)
{
    int label = 0;
    int dx[4] = {-1, 1, 0, 0}; // Left, Right, Up, Down
    int dy[4] = {0, 0, -1, 1};

    // Initialize labels array
    memset(labels, 0, sizeof(int) * ROWS * COLUMNS);

    for (int r = 0; r < ROWS; r++)
    {
        for (int c = 0; c < COLUMNS; c++)
        {
            if (binaryMask[r][c] == 1 && labels[r][c] == 0)
            {
                label++;
                // BFS queue
                int queue_r[ROWS * COLUMNS];
                int queue_c[ROWS * COLUMNS];
                int front = 0;
                int back = 0;

                // Enqueue current pixel
                queue_r[back] = r;
                queue_c[back] = c;
                back++;
                labels[r][c] = label;

