blumenkratzz/STM32-Motion-Tracking-Mount/Core/Src/main.c
                while (front < back)
                {
                    int cr = queue_r[front];
                    int cc = queue_c[front];
                    front++;

                    // Check neighbors
                    for (int i = 0; i < 4; i++)
                    {
                        int nr = cr + dy[i];
                        int nc = cc + dx[i];

                        if (nr >= 0 && nr < ROWS && nc >= 0 && nc < COLUMNS)
                        {
                            if (binaryMask[nr][nc] == 1 && labels[nr][nc] == 0)
                            {
                                // Enqueue neighbor
                                queue_r[back] = nr;
                                queue_c[back] = nc;
                                back++;
                                labels[nr][nc] = label;
                            }
                        }
                    }
                }
            }
        }
    }

    *numComponents = label;
}


float calculateCentroidWeightedSum(float mlx90640To_2[SENSOR_ARRAY_SIZE], int *blobSize)
{
    // Step 1: Create binary mask
    int binaryMask[ROWS][COLUMNS] = {0};
    for (int r = 0; r < ROWS; r++)
    {
        for (int c = 0; c < COLUMNS; c++)
        {
            int index = r * COLUMNS + c;
            if (mlx90640To_2[index] >= TARGET_MIN_TEMP)
            {
                binaryMask[r][c] = 1;
            }
        }
    }

    // Step 2: Perform connected component labeling
    int labels[ROWS][COLUMNS];
    int numComponents = 0;
    connectedComponents(binaryMask, labels, &numComponents);

    if (numComponents == 0)
    {
        // No blobs found
        return 0.0f;
    }

    // Step 3: Identify the largest blob
    int componentSizes[numComponents + 1]; // Index 0 unused
    memset(componentSizes, 0, sizeof(int) * (numComponents + 1));

    for (int r = 0; r < ROWS; r++)
    {
        for (int c = 0; c < COLUMNS; c++)
        {
            int labelValue = labels[r][c];
            if (labelValue > 0)
            {
                componentSizes[labelValue]++;
            }
        }
    }

    int largestComponentLabel = 1;
    int largestComponentSize = componentSizes[1];

    for (int i = 2; i <= numComponents; i++)
    {
        if (componentSizes[i] > largestComponentSize)
        {
            largestComponentSize = componentSizes[i];
            largestComponentLabel = i;
        }
    }

    // Step 4: Calculate weighted sum
    float weightedSum = 0.0f;
    int countTemperatures = 0;

    for (int r = 0; r < ROWS; r++)
    {
        for (int c = 0; c < COLUMNS; c++)
        {
            if (labels[r][c] == largestComponentLabel)
            {
                int index = r * COLUMNS + c;
                float temperature = mlx90640To_2[index];
                float weight = getPixelWeight(temperature);

                weightedSum += weight * temperature;
                countTemperatures++;
            }
        }
    }
    // Return the size of the largest blob
       *blobSize = largestComponentSize;

    return weightedSum;
}

int getZoneInfo(float centroidWeightedSum, int *headThresholdPixelCount, int *targetDetected, int *blobSize)
{
    int numZones = sizeof(zones) / sizeof(zones[0]);

    for (int i = 0; i < numZones; i++)
    {
        if (centroidWeightedSum >= zones[i].centroidWeightedSumMin && centroidWeightedSum < zones[i].centroidWeightedSumMax)
        {
            *headThresholdPixelCount = zones[i].headThresholdPixelCount;

            // Check blob size requirement for the zone
            if (*blobSize >= MINIMUM_TARGET_BLOB_SIZE)
            {
                *targetDetected = 1; // Target is valid
                return zones[i].zoneNumber; // Return zone number
            }
            else
            {
                *targetDetected = 0; // Target invalid due to insufficient blob size
                return -1;
            }


        }
    }

    // If centroidWeightedSum is out of range or blob size is too small
    *headThresholdPixelCount = 0;
    *targetDetected = 0;
    return -1; // Indicates outside detection range
}



void setLEDState(int zoneInfo) // Example: PA5 used for LED
{

	if (zoneInfo != -1)
		{
		HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_SET);
		}
	else
		{
		HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_RESET);
		}
}

int printer(I2C_HandleTypeDef *hi2c, uint16_t *eeMLX90640, paramsMLX90640 *mlx90640, float *mlx90640To,
            uint16_t *frame, int *highestRowGroupStart, int *highestColGroupStart)
{
    /* Waveshare data */
    sprintf(MLX90640_Test_Buffer, "\r\n==========================Display Grid==========================\r\n");
    HAL_UART_Transmit(&huart2, (uint8_t *)MLX90640_Test_Buffer, strlen(MLX90640_Test_Buffer), HAL_MAX_DELAY);

    // Print out Column numbers, starting from right (Column 1) to left (Column 32)
    sprintf(MLX90640_Test_Buffer, "     Col"); // Initial spacing for row labels
    HAL_UART_Transmit(&huart2, (uint8_t *)MLX90640_Test_Buffer, strlen(MLX90640_Test_Buffer), HAL_MAX_DELAY);

    for (int col = 31; col >= 0; col--)
    {
        int displayCol = col + 1; // Adjust column number for display (32 down to 1)

        if (displayCol >= *highestColGroupStart && displayCol < (*highestColGroupStart + COLUMN_CHUNK))
        {
            // Print in white for highest column group
            sprintf(MLX90640_Test_Buffer, " \033[1;37m%2d \033[0m  ", displayCol);
        }
        else
        {
            // Print in blue for other columns
            sprintf(MLX90640_Test_Buffer, " \033[1;34m%2d \033[0m  ", displayCol);
        }
        HAL_UART_Transmit(&huart2, (uint8_t *)MLX90640_Test_Buffer, strlen(MLX90640_Test_Buffer), HAL_MAX_DELAY);
    }
    sprintf(MLX90640_Test_Buffer, "\r\n");
    HAL_UART_Transmit(&huart2, (uint8_t *)MLX90640_Test_Buffer, strlen(MLX90640_Test_Buffer), HAL_MAX_DELAY);

    // Now loop over rows and columns
    for (int row = 0; row < ROWS; row++)
    {
        // Check if the current row is within the target row group
        if (*highestRowGroupStart != -1 && row >= (*highestRowGroupStart - 1) && row < (*highestRowGroupStart - 1 + ROW_CHUNK))
        {
            // Print in white for target row group
            sprintf(MLX90640_Test_Buffer, "\033[1;37mRow %2d:\033[0m ", row + 1);
        }
        else
        {
            // Print in blue for other rows
            sprintf(MLX90640_Test_Buffer, "\033[1;34mRow %2d:\033[0m ", row + 1);
        }
        HAL_UART_Transmit(&huart2, (uint8_t *)MLX90640_Test_Buffer, strlen(MLX90640_Test_Buffer), HAL_MAX_DELAY);

        // Loop over columns in reverse order
        for (int col = 31; col >= 0; col--)
        {
            int index = row * COLUMNS + col;
            float temp = mlx90640To[index];

            // Check temperature ranges and add color codes accordingly
            if (temp <= TARGET_MIN_TEMP)
            {
                // Green color for temperature <= 24
                sprintf(MLX90640_Test_Buffer, "\033[32m%5.2f \033[0m", temp);
            }
            else if (temp > TARGET_MIN_TEMP && temp <= 34.0)
            {
                // Yellow color for temperature between 24 and 34
                sprintf(MLX90640_Test_Buffer, "\033[33m%5.2f \033[0m", temp);
            }
            else
            {
                // Red color for temperature > 34
                sprintf(MLX90640_Test_Buffer, "\033[31m%5.2f \033[0m", temp);
            }
            HAL_UART_Transmit(&huart2, (uint8_t *)MLX90640_Test_Buffer, strlen(MLX90640_Test_Buffer), HAL_MAX_DELAY);
        }
        // End of row, print newline
        sprintf(MLX90640_Test_Buffer, "\r\n");
        HAL_UART_Transmit(&huart2, (uint8_t *)MLX90640_Test_Buffer, strlen(MLX90640_Test_Buffer), HAL_MAX_DELAY);
    }

    sprintf(MLX90640_Test_Buffer, "\r\n==========================Display Grid==========================\r\n");
    HAL_UART_Transmit(&huart2, (uint8_t *)MLX90640_Test_Buffer, strlen(MLX90640_Test_Buffer), HAL_MAX_DELAY);

