blumenkratzz/STM32-Motion-Tracking-Mount/Core/Src/main.c
    return 0;
}




//STM DECLARATION STUFF
void Error_Handler(void)
{
		  //HAL_GPIO_TogglePin (GPIOA, GPIO_PIN_5);
		  //HAL_Delay (100);   /* Insert delay 100 ms */
}
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

//  * Configure the main internal regulator output voltage

  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);
//  * Initializes the CPU, AHB and APB busses clocks

  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 8;//8M�ⲿ����
  RCC_OscInitStruct.PLL.PLLN = 336;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 7;
  HAL_RCC_OscConfig(&RCC_OscInitStruct);
//  * Initializes the CPU, AHB and APB busses clocks

  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

  HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5);
}
void initSystem(void)
{
	HAL_Init();
	SystemClock_Config();
	 // Enable clocks before initializing peripherals
	__HAL_RCC_GPIOA_CLK_ENABLE();
	__HAL_RCC_GPIOB_CLK_ENABLE();
	__HAL_RCC_USART1_CLK_ENABLE(); // For servo communication
	__HAL_RCC_USART2_CLK_ENABLE(); // For console output

	MX_USART2_UART_Init(); // Initialize UART2 for console output
	MLX90640_I2CInit();

	GPIO_InitTypeDef GPIO_InitStruct = {0};
	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_RESET);
	GPIO_InitStruct.Pin = GPIO_PIN_5;
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
	HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

	setupMotorControl();

}

int main()
{
	//System Initialization, GPIO Configuration, Peripheral Setup
		initSystem();

	//CHECK FOR ANY HI2C Pointers mismatch,

		sprintf(MLX90640_Test_Buffer, "\rhi2c1: %p &hi2c1: %p \r\n", hi2c1.Instance, &hi2c1);
		HAL_UART_Transmit(&huart2, (uint8_t*)MLX90640_Test_Buffer, strlen(MLX90640_Test_Buffer), HAL_MAX_DELAY);
		sprintf(MLX90640_Test_Buffer, "\rhi2c2: %p &hi2c2: %p \r\n", hi2c2.Instance, &hi2c2);
		HAL_UART_Transmit(&huart2, (uint8_t*)MLX90640_Test_Buffer, strlen(MLX90640_Test_Buffer), HAL_MAX_DELAY);
		sprintf(MLX90640_Test_Buffer, "\rhi2c3: %p &hi2c3: %p \r\n", hi2c3.Instance , &hi2c3);
		HAL_UART_Transmit(&huart2, (uint8_t*)MLX90640_Test_Buffer, strlen(MLX90640_Test_Buffer), HAL_MAX_DELAY);

		// Initialize sensors
		sensors[SENSOR_LEFT].hi2c = &hi2c1;
		sensors[SENSOR_MIDDLE].hi2c = &hi2c2;
		sensors[SENSOR_RIGHT].hi2c = &hi2c3;

		//SET PROPER MODE FOR SENSOR 1

		MLX90640_SetRefreshRate(sensors[SENSOR_LEFT].hi2c,MLX90640_ADDR, RefreshRate);
		MLX90640_SetChessMode(sensors[SENSOR_LEFT].hi2c,MLX90640_ADDR);

		//SET PROPER MODE FOR SENSOR 2

		MLX90640_SetRefreshRate(sensors[SENSOR_MIDDLE].hi2c,MLX90640_ADDR, RefreshRate);
		MLX90640_SetChessMode(sensors[SENSOR_MIDDLE].hi2c,MLX90640_ADDR);

		//SET PROPER MODE FOR SENSOR 3

		MLX90640_SetRefreshRate(sensors[SENSOR_RIGHT].hi2c,MLX90640_ADDR, RefreshRate);
		MLX90640_SetChessMode(sensors[SENSOR_RIGHT].hi2c,MLX90640_ADDR);

	    int headThresholdPixelCount = 0;
	    float centroidWeightedSum = 0;
	    int targetZone = -1;
	    int blobSize = 0;
		uint16_t adc_value = 0;
		uint32_t masterTrackingDelay = 0;

		// Initialize other variables as needed
		for (int i = 2; i < NUM_SENSORS; i++)
		{
		    sensors[i].targetDetected = 0;
		    sensors[i].highestRowGroupStart = 0;
		    sensors[i].highestColGroupStart = 0;
		}

	while (1)
	{
		char clear_command[] = "\033[2J\033[H"; // ANSI escape code to clear screen and move cursor to home
		HAL_UART_Transmit(&huart2, (uint8_t *)clear_command, strlen(clear_command), HAL_MAX_DELAY);

	    // Start message
	    sprintf(MLX90640_Test_Buffer, "\n\nstart\r\n");
	    HAL_UART_Transmit(&huart2, (uint8_t *)MLX90640_Test_Buffer, strlen(MLX90640_Test_Buffer), HAL_MAX_DELAY);

		for (int i = 2; i < NUM_SENSORS; i++)//CURRENTLY SKIPING HI2C1 SO HAVE TO START AT 1, OTHERWISE START AT 0 TO INCLUDE HI2C1
		{
#ifdef SENSOR_DEBUG
			sprintf(MLX90640_Test_Buffer, "\r\nSENSOR_DEBUG info for sensor %.2d\r\n", i);
			HAL_UART_Transmit(&huart2, (uint8_t*)MLX90640_Test_Buffer, strlen(MLX90640_Test_Buffer), HAL_MAX_DELAY);
#endif
			//HAL_I2C_MspDeInit(&hi2c1);
			//HAL_Delay(20);
			//HAL_I2C_MspInit(&hi2c1);
			int status = retriever(sensors[i].hi2c, sensors[i].eeMLX90640, &sensors[i].mlx90640,
			                       sensors[i].mlx90640To, sensors[i].frame, &sensors[i].targetDetected,
			                       &sensors[i].highestRowGroupStart, &sensors[i].highestColGroupStart,
			                       NUM_FRAMES_TO_COMBINE);

			if (status != 0)
			{
			    // Handle error if needed
				sprintf(MLX90640_Test_Buffer, "Error status occured during retrieval of index %d", i);
				HAL_UART_Transmit(&huart2, (uint8_t*)MLX90640_Test_Buffer, strlen(MLX90640_Test_Buffer), HAL_MAX_DELAY);
			    continue;
			}
			 // Compute overall average and assign to sensors[i].avg
			    //sensors[i].avg = overallAvg(sensors[i].mlx90640To);
#ifdef SENSOR_DEBUG
			    // Optionally print the average for this sensor
			    sprintf(MLX90640_Test_Buffer, "Sensor %d Average Temperature: %.2f\n\r", i, sensors[i].avg);
			    HAL_UART_Transmit(&huart2, (uint8_t*)MLX90640_Test_Buffer, strlen(MLX90640_Test_Buffer), HAL_MAX_DELAY);
#endif
			    // Calculate weighted sum of the centroid
			    centroidWeightedSum = calculateCentroidWeightedSum(sensors[i].mlx90640To, &sensors[i].blobSize);
			    sensors[i].centroidWeightedSum = centroidWeightedSum;
			    blobSize = sensors[i].blobSize;

#ifdef SENSOR_DEBUG
			       sprintf(MLX90640_Test_Buffer, "Sensor %d Centroid Weighted Sum: %.2f, Blob Size: %d\n\r", i, centroidWeightedSum, sensors[i].blobSize);
			       HAL_UART_Transmit(&huart2, (uint8_t*)MLX90640_Test_Buffer, strlen(MLX90640_Test_Buffer), HAL_MAX_DELAY);
#endif

