blumenkratzz/STM32-Motion-Tracking-Mount/Core/Src/main.c
		}

		// Determine the sensor with the highest centroid weighted sum
		// Currently, blobSize (clustering) is part of detection scheme, Might be improved to be a combined factor using coef-s.
		// detectionFactor = centroidWeightedSum + (blobSize*centroidWeightedSum*0.1)
		// 12 pixels, with 3 pixel blob size each (e.g. 4 people), VS. 10 pixel of single person (blob)
		// detectionFactor= a + 0.1*a*3 = 1.3, VS. b + 0.1*b*10 = 2, Assuming a=b where a, b, are respective centroids of each blob
		// Or you can see with increasing a, that b still takes over due to closer clustering (but up to a point)
		int max_index = 0;
		float max_centroid_weighted_sum = 0;
		float detectionMetric = 0;
		for (int i = 2; i < NUM_SENSORS; i++)
		{
		    /*if (sensors[i].centroidWeightedSum > max_centroid_weighted_sum)
		    {
		    	max_centroid_weighted_sum = sensors[i].centroidWeightedSum;
		        max_index = i;
#ifdef SENSOR_DEBUG
				sprintf(MLX90640_Test_Buffer, "\r\nSensor %d Found Higher Centroid Weighted Sum: %.2f\r\n", max_index, sensors[max_index].centroidWeightedSum);
				HAL_UART_Transmit(&huart2, (uint8_t*)MLX90640_Test_Buffer, strlen(MLX90640_Test_Buffer), HAL_MAX_DELAY);
#endif
		    }*/

		    if ((sensors[i].centroidWeightedSum * sensors[i].blobSize) > detectionMetric)
		    {
				detectionMetric=sensors[i].centroidWeightedSum * sensors[i].blobSize;
		        max_index = i;
#ifdef SENSOR_DEBUG
				sprintf(MLX90640_Test_Buffer, "\r\nSensor %d Found Higher detectionMetric (Centroid Weighted Sum * Blob Size): %.2f\r\n", max_index, sensors[max_index].centroidWeightedSum);
				HAL_UART_Transmit(&huart2, (uint8_t*)MLX90640_Test_Buffer, strlen(MLX90640_Test_Buffer), HAL_MAX_DELAY);
#endif
		    }
		}

#ifdef SENSOR_DEBUG
		// Define a variable to store the sensor direction as a string
		char sensor_direction[20];

		// Assign the direction based on max_index
		if (max_index == SENSOR_LEFT) {
		    strcpy(sensor_direction, "SENSOR_LEFT");
		} else if (max_index == SENSOR_RIGHT) {
		    strcpy(sensor_direction, "SENSOR_RIGHT");
		} else if (max_index == SENSOR_MIDDLE) {
		    strcpy(sensor_direction, "SENSOR_MIDDLE");
		} else {
		    strcpy(sensor_direction, "UNKNOWN");
		}
		sprintf(MLX90640_Test_Buffer, "\r\n\033[32mDisplaying Sensor%2d's grid (%s) \033[0m\r\n", max_index, sensor_direction);
		HAL_UART_Transmit(&huart2, (uint8_t*)MLX90640_Test_Buffer, strlen(MLX90640_Test_Buffer), HAL_MAX_DELAY);
#endif


		// Read potentiometer value
		adc_value = ReadPotentiometer();

#ifdef SENSOR_DEBUG
		sprintf(MLX90640_Test_Buffer, "Raw ADC Value: %u\r\n", adc_value);
		HAL_UART_Transmit(&huart2, (uint8_t *)MLX90640_Test_Buffer, strlen(MLX90640_Test_Buffer), HAL_MAX_DELAY);
#endif
		// Map ADC value to delay
		masterTrackingDelay = MapDelay(adc_value);

#ifdef SENSOR_DEBUG
		// Debug: Print ADC value and calculated delay
		sprintf(MLX90640_Test_Buffer, "ADC: %u, Delay: %lu ms\n\r", adc_value, masterTrackingDelay);
		HAL_UART_Transmit(&huart2, (uint8_t *)MLX90640_Test_Buffer, strlen(MLX90640_Test_Buffer), HAL_MAX_DELAY);
#endif

		// Process the selected sensor using a switch case
		switch (max_index)
		{
		    case SENSOR_LEFT:
		        // Sensor 1 has the highest average temperature

			    targetZone = getZoneInfo(sensors[SENSOR_LEFT].centroidWeightedSum, &headThresholdPixelCount, &sensors[SENSOR_LEFT].targetDetected, &sensors[SENSOR_LEFT].blobSize);
			    sprintf(MLX90640_Test_Buffer, "Sensor %d Zone: %d\n\r", SENSOR_LEFT, targetZone);
			    HAL_UART_Transmit(&huart2, (uint8_t*)MLX90640_Test_Buffer, strlen(MLX90640_Test_Buffer), HAL_MAX_DELAY);

			    sensors[SENSOR_LEFT].highestColumnIndex = avgBySector(sensors[SENSOR_LEFT].mlx90640To,
		    	        &sensors[SENSOR_LEFT].highestRowGroupStart, &sensors[SENSOR_LEFT].highestColGroupStart, &sensors[SENSOR_LEFT].targetDetected, headThresholdPixelCount, targetZone);
				// Apply Master Tracking Delay
				HAL_Delay(masterTrackingDelay);

			    rotateToTargetColumn(sensors[SENSOR_LEFT].highestColGroupStart, targetZone, SENSOR_LEFT);
			    rotateToTargetRow(sensors[SENSOR_LEFT].highestRowGroupStart, targetZone);
#ifdef SENSOR_DEBUG
			    printer(sensors[SENSOR_LEFT].hi2c, sensors[SENSOR_LEFT].eeMLX90640, &sensors[SENSOR_LEFT].mlx90640,sensors[SENSOR_LEFT].mlx90640To, sensors[SENSOR_LEFT].frame, &sensors[SENSOR_LEFT].highestRowGroupStart, &sensors[SENSOR_LEFT].highestColGroupStart);
#endif
		        setLEDState(targetZone);
		        break;

		    case SENSOR_MIDDLE:
		        // Sensor 2 has the highest average temperature
			    targetZone= getZoneInfo(sensors[SENSOR_MIDDLE].centroidWeightedSum, &headThresholdPixelCount, &sensors[SENSOR_MIDDLE].targetDetected, &sensors[SENSOR_MIDDLE].blobSize);
			    sprintf(MLX90640_Test_Buffer, "Sensor %d Zone: %d\n\r", SENSOR_MIDDLE, targetZone);
			    HAL_UART_Transmit(&huart2, (uint8_t*)MLX90640_Test_Buffer, strlen(MLX90640_Test_Buffer), HAL_MAX_DELAY);
		    	sensors[SENSOR_MIDDLE].highestColumnIndex = avgBySector(sensors[SENSOR_MIDDLE].mlx90640To,
		    	        &sensors[SENSOR_MIDDLE].highestRowGroupStart, &sensors[SENSOR_MIDDLE].highestColGroupStart, &sensors[SENSOR_MIDDLE].targetDetected, headThresholdPixelCount, targetZone);
				// Apply Master Tracking Delay
				HAL_Delay(masterTrackingDelay);

		    	rotateToTargetColumn(sensors[SENSOR_MIDDLE].highestColGroupStart, targetZone, SENSOR_MIDDLE);
			    rotateToTargetRow(sensors[SENSOR_MIDDLE].highestRowGroupStart, targetZone);
#ifdef SENSOR_DEBUG
		        printer(sensors[SENSOR_MIDDLE].hi2c, sensors[SENSOR_MIDDLE].eeMLX90640, &sensors[SENSOR_MIDDLE].mlx90640,sensors[SENSOR_MIDDLE].mlx90640To, sensors[SENSOR_MIDDLE].frame, &sensors[SENSOR_MIDDLE].highestRowGroupStart, &sensors[SENSOR_MIDDLE].highestColGroupStart);
#endif
		        setLEDState(targetZone);
		        break;

		    case SENSOR_RIGHT:
		        //Sensor 3 has the highest average temperature
			    targetZone= getZoneInfo(sensors[SENSOR_RIGHT].centroidWeightedSum, &headThresholdPixelCount, &sensors[SENSOR_RIGHT].targetDetected, &sensors[SENSOR_RIGHT].blobSize);
			    sprintf(MLX90640_Test_Buffer, "Sensor %d Zone: %d\n\r", SENSOR_RIGHT, targetZone);
			    HAL_UART_Transmit(&huart2, (uint8_t*)MLX90640_Test_Buffer, strlen(MLX90640_Test_Buffer), HAL_MAX_DELAY);

		    	sensors[SENSOR_RIGHT].highestColumnIndex = avgBySector(sensors[SENSOR_RIGHT].mlx90640To,
		    	        &sensors[SENSOR_RIGHT].highestRowGroupStart, &sensors[SENSOR_RIGHT].highestColGroupStart, &sensors[SENSOR_RIGHT].targetDetected, headThresholdPixelCount, targetZone);
				// Apply Master Tracking Delay
				HAL_Delay(masterTrackingDelay);

				rotateToTargetColumn(sensors[SENSOR_RIGHT].highestColGroupStart, targetZone, SENSOR_RIGHT);
			    rotateToTargetRow(sensors[SENSOR_RIGHT].highestRowGroupStart, targetZone);
#ifdef SENSOR_DEBUG
			    printer(sensors[SENSOR_RIGHT].hi2c, sensors[SENSOR_RIGHT].eeMLX90640, &sensors[SENSOR_RIGHT].mlx90640,sensors[SENSOR_RIGHT].mlx90640To, sensors[SENSOR_RIGHT].frame, &sensors[SENSOR_RIGHT].highestRowGroupStart, &sensors[SENSOR_RIGHT].highestColGroupStart);
#endif
		        setLEDState(targetZone);

		        break;

		    default:
		        // Handle unexpected cases if necessary

		        break;
		}

		// Ping each servo motor to verify communication
		checkServoConnection();
		//WheelMode(1);
		//rotateConstantSpeed(1);

	    /* End message */
	    sprintf(MLX90640_Test_Buffer, "end\r\n");
	    HAL_UART_Transmit(&huart2, (uint8_t *)MLX90640_Test_Buffer, strlen(MLX90640_Test_Buffer), HAL_MAX_DELAY);

#ifdef SENSOR_DEBUG
		uint8_t userInput;
		        if (HAL_UART_Receive(&huart2, &userInput, 1, 10) == HAL_OK)
		        {
		            if (userInput == 'c' || userInput == 'C')
		            {
		                calibrateMotors();
		            }
		        }
#endif

		}



	    return 0;
}

static void MX_USART2_UART_Init(void)
{
	GPIO_InitTypeDef GPIO_InitStruct = {0};


	    GPIO_InitStruct.Pin = GPIO_PIN_2 | GPIO_PIN_3;
	    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
	    GPIO_InitStruct.Pull = GPIO_NOPULL;
	    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	    GPIO_InitStruct.Alternate = GPIO_AF7_USART2;
	    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  huart2.Instance = USART2;
  huart2.Init.BaudRate = 115200;
  huart2.Init.WordLength = UART_WORDLENGTH_8B;
  huart2.Init.StopBits = UART_STOPBITS_1;
  huart2.Init.Parity = UART_PARITY_NONE;
  huart2.Init.Mode = UART_MODE_TX_RX;
  huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart2.Init.OverSampling = UART_OVERSAMPLING_16;
  if (HAL_UART_Init(&huart2) != HAL_OK)
  {

  }

}
